/**
 * 二维数组初始化示例3
 *
 * @author Yu
 * @create 2026-03-10 22:05
 */
public class Example3 {
    public static void main(String[] args) {
        // 存储多组成绩
        int[][] grades = {
                {89,75,99,100},
                {88,96,78,63,100,86},
                {56,63,58},
                {99,66,77,88}
        };

        // 存储多组姓名
        String[][] names = {
                {"张三","李四", "王五", "赵六"},
                {"刘备","关羽","张飞","诸葛亮","赵云","马超"},
                {"曹丕","曹植","曹冲"},
                {"孙权","周瑜","鲁肃","黄盖"}
        };
    }
}
